# Terraform environment at22
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
module.app_configuration.data.azurerm_resource_group.hub: Reading...
module.app_configuration.data.azurerm_client_config.hub: Reading...
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_private_dns_zone.blob_storage: Reading...
module.app_configuration.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_virtual_network.hub_vnet: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.blob_storage: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
module.app_configuration.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.app_configuration.azurerm_app_configuration_key.key_value["Platform:RegisterEndpoint_at22"] will be destroyed
  # (because key ["Platform:RegisterEndpoint_at22"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_value" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - etag                   = "El63mODx9iD414BgZJN1PpMx2TjrN1f254XZXym1fgk" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Platform:RegisterEndpoint?label=at22" -> null
      - key                    = "Platform:RegisterEndpoint" -> null
      - label                  = "at22" -> null
      - locked                 = false -> null
      - tags                   = {} -> null
      - type                   = "kv" -> null
      - value                  = "http://altinn-register.default.svc.cluster.local" -> null
        # (2 unchanged attributes hidden)
    }

  # module.app_configuration.azurerm_app_configuration_key.key_value["Platform:ResourceRegistryEndpoint_at22"] will be destroyed
  # (because key ["Platform:ResourceRegistryEndpoint_at22"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_value" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - etag                   = "2EPcLUSxV55bElgTPPDn-l4Pwvu7Mz722mTB0m9jypw" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Platform:ResourceRegistryEndpoint?label=at22" -> null
      - key                    = "Platform:ResourceRegistryEndpoint" -> null
      - label                  = "at22" -> null
      - locked                 = false -> null
      - tags                   = {} -> null
      - type                   = "kv" -> null
      - value                  = "http://altinn-resource-registry.default.svc.cluster.local" -> null
        # (2 unchanged attributes hidden)
    }

  # module.app_configuration.azurerm_app_configuration_key.key_value["Platform:SblBridge:Endpoint_at22"] will be created
  + resource "azurerm_app_configuration_key" "key_value" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Platform:SblBridge:Endpoint"
      + label                  = "at22"
      + locked                 = false
      + type                   = "kv"
      + value                  = "https://at22.altinn.cloud/sblbridge/"
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @Alxandr |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at22/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at22_spokes.tfstate.tfplan`